# PolymeshFacet Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PolymeshFacet Class
Members See Also
---
A class representing one triangular piece - a facet - in a polymesh topology.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class PolymeshFacet
```

Visual Basic
---
```text
Public Class PolymeshFacet
```

Visual C++
---
```text
public ref class PolymeshFacet
```

# Remarks
It can also be used to create TopographySurface. Each facet is defined by indices of three vertices of the polymesh.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..PolymeshFacet
# See Also
PolymeshFacet Members
Autodesk.Revit.DB Namespace